app/views/teams/_list.html.erb

			<% @users.each do |user| %>
				<tr <% if @team.users.include?(user) %>style="background-color: #eeffee"<% end %>  id="id<%=user.id%>">
---
SELECT  "users".* FROM "users" WHERE ((LOWER(users.firstName) LIKE 'П%' OR LOWER(users.lastName) LIKE 'П%')) ORDER BY "users"."id" ASC LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 0]]
SELECT  1 AS one FROM "users" INNER JOIN "teams_users" ON "users"."id" = "teams_users"."user_id" WHERE "teams_users"."team_id" = ? AND "users"."id" = ? LIMIT ?  [["team_id", 2], ["id", 2], ["LIMIT", 1]]