app/views/teams/index.html.erb

SELECT "teams".* FROM "teams" INNER JOIN "teams_users" ON "teams"."id" = "teams_users"."team_id" WHERE "teams_users"."user_id" = ?  [["user_id", 1]]
---
	<% if @teams != nil %>
		<% current_user.teams.sort_by{|team| team.updated_at}.each do |team| %>

SELECT "users".* FROM "users" INNER JOIN "teams_users" ON "users"."id" = "teams_users"."user_id" WHERE "teams_users"."team_id" = ?  [["team_id", 1]]
---
				<td><%= team.teamTitle %></td>
				<td><%= team.users.length %></td>