app/views/teams/index.html.erb

SELECT  1 AS one FROM "users" INNER JOIN "teams_users" ON "users"."id" = "teams_users"."user_id" WHERE "teams_users"."team_id" = ? AND "users"."id" = ? LIMIT ?  [["team_id", 1], ["id", 5], ["LIMIT", 1]]
---
	<% if @teams != nil %>
		<% @teams.reject{|team| not team.users.include?(current_user)}.sort_by{|team| team.updated_at}.each do |team| %>