app/views/teams/show.html.erb


<% if not logged_in? or not @team.users.include?(current_user) %>
---
SELECT  1 AS one FROM "users" INNER JOIN "teams_users" ON "users"."id" = "teams_users"."user_id" WHERE "teams_users"."team_id" = ? AND "users"."id" = ? LIMIT ?  [["team_id", 1], ["id", 5], ["LIMIT", 1]]
SELECT "users".* FROM "users" INNER JOIN "teams_users" ON "users"."id" = "teams_users"."user_id" WHERE "teams_users"."team_id" = ?  [["team_id", 1]]