app/views/events/index.html.erb

		<% @events.reject{|event| event.dateEnd < Date.today}.sort_by{|event| event.dateStart}.each do |event| %>
			<tr <% if logged_in? and current_user.events.include?(event) %>style="background-color: #eeffee"<% end %>>
---
SELECT  1 AS one FROM "events" INNER JOIN "events_users" ON "events"."id" = "events_users"."event_id" WHERE "events_users"."user_id" = ? AND "events"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "events".* FROM "events"

					<% if event.dateStart > Date.tomorrow %>
						<% if event.users.include?(current_user) %>
							<strong><%= link_to ((event.teams & current_user.teams).first().teamTitle), team_path((event.teams & current_user.teams).first())%></strong>
---
SELECT  1 AS one FROM "users" INNER JOIN "events_users" ON "users"."id" = "events_users"."user_id" WHERE "events_users"."event_id" = ? AND "users"."id" = ? LIMIT ?  [["event_id", 1], ["id", 2], ["LIMIT", 1]]
SELECT "teams".* FROM "teams" INNER JOIN "events_teams" ON "teams"."id" = "events_teams"."team_id" WHERE "events_teams"."event_id" = ?  [["event_id", 1]]