app/views/events/register.html.erb

SELECT  1 AS one FROM "users" INNER JOIN "teams_users" ON "users"."id" = "teams_users"."user_id" WHERE "teams_users"."team_id" = ? AND "users"."id" = ? LIMIT ?  [["team_id", 4], ["id", 2], ["LIMIT", 1]]
SELECT "teams".* FROM "teams"
SELECT "users".* FROM "users" INNER JOIN "events_users" ON "users"."id" = "events_users"."user_id" WHERE "events_users"."event_id" = ?  [["event_id", 3]]
---
	<% if @teams != nil %>
		<% @teams.reject{|team| not (team.users.include?(current_user) and team.users.length >= @event.teamMinSize and team.users.length <= @event.teamMaxSize)}.sort_by{|team| team.updated_at}.each do |team| %>