app/views/events/show.html.erb

SELECT  1 AS one FROM "users" INNER JOIN "events_users" ON "users"."id" = "events_users"."user_id" WHERE "events_users"."event_id" = ? AND "users"."id" = ? LIMIT ?  [["event_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "teams".* FROM "teams" INNER JOIN "events_teams" ON "teams"."id" = "events_teams"."team_id" WHERE "events_teams"."event_id" = ?  [["event_id", 2]]
---
	<% if logged_in? and @event.dateStart > Date.tomorrow %>
		<% if @event.users.include?(current_user) %>
			Вы зарегистрированы на это мероприятие с командой <%= link_to ((@event.teams & current_user.teams).first().teamTitle), team_path((@event.teams & current_user.teams).first())%> </strong>

SELECT "users".* FROM "users" INNER JOIN "teams_users" ON "users"."id" = "teams_users"."user_id" WHERE "teams_users"."team_id" = ?  [["team_id", 7]]
---
					<td>
						<%= team.users.map { |u| u.lastName }.join ', ' %>