app/controllers/events_controller.rb

INSERT INTO "events" ("eventTitle", "eventType", "teamMinSize", "teamMaxSize", "dateStart", "dateEnd", "eventPlace", "eventDescription", "eventResults", "created_at", "updated_at", "schoolType") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@event = Event.new(event_params)

		if @event.save

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "events" SET "dateStart" = ?, "dateEnd" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["dateStart", "2018-01-11"], ["dateEnd", "2018-01-12"], ["updated_at", "2018-01-10 12:31:18.622962"], ["id", 3]]
---
	def update
		@event = Event.find(params[:id])

		if @event.update(event_params)

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "users".* FROM "users" INNER JOIN "teams_users" ON "users"."id" = "teams_users"."user_id" WHERE "teams_users"."team_id" = ?  [["team_id", 7]]
---
	def addteam
		@event = Event.find(params[:event_id])
		@team = Team.find(params[:team_id])

		#		@team.users.each do |user|
		#			if @event.fathersNameReq and not user.fathersName.present? or
		#					@event.bornReq and not user.born.present? or
		#					@event.schoolReq and not user.school.present? or
		#					@event.groupReq and not user.group.present? or
		#					@event.teeSizeReq and not user.teeSize.present? or
		#					@event.phoneNumberReq and not user.phoneNumber.present?
		#				return
		#			end
		#		end

		@event.teams << @team

		@team.users.each do |user|

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT "teams".* FROM "teams"
---
	def register
		@event = Event.find(params[:format])
		@teams = Team.all