app/controllers/teams_controller.rb

	def edit
		@team = Team.find(params[:id])
		@users = User.all;
=begin
		@filterrific = initialize_filterrific(
			User,
			params[:filterrific],
			persistence_id: 'shared_key',
			default_filter_params: {},
			) or return
		@users = @filterrific.find.page(params[:page]).per_page(10)
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE ((LOWER(users.firstName) LIKE 'Ло%' OR LOWER(users.lastName) LIKE 'Ло%')) ORDER BY "users"."id" ASC LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 0]]
SELECT  "users".* FROM "users" WHERE ((LOWER(users.firstName) LIKE 'Ло%' OR LOWER(users.lastName) LIKE 'Ло%')) LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users" WHERE ((LOWER(users.firstName) LIKE 'Ло%' OR LOWER(users.lastName) LIKE 'Ло%'))

	def create
		@team = Team.new(team_params)
		@team.users << current_user
---
INSERT INTO "teams" ("teamTitle", "created_at", "updated_at", "schoolType") VALUES (?, ?, ?, ?)  [["teamTitle", "Pyotr Team"], ["created_at", "2018-01-13 09:36:54.477237"], ["updated_at", "2018-01-13 09:36:54.477237"], ["schoolType", "school"]]

	def update
		@user = User.find(params[:user_id])
		@team = Team.find(params[:id])
		if !@team.users.include? @user
			@team.users << @user
			if @team.schoolType == nil
				@team.schoolType = @user.occupation
			else
				if @team.schoolType != @user.occupation
					@team.schoolType = 'mixed'
				end
			end
		else
			@team.events.each do |event|
				event.users.delete(@user)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" INNER JOIN "teams_users" ON "users"."id" = "teams_users"."user_id" WHERE "teams_users"."team_id" = ? AND "users"."id" = ? LIMIT ?  [["team_id", 4], ["id", 3], ["LIMIT", 1]]
SELECT "users".* FROM "users" INNER JOIN "teams_users" ON "users"."id" = "teams_users"."user_id" WHERE "teams_users"."team_id" = ?  [["team_id", 4]]
SELECT "events".* FROM "events" INNER JOIN "events_teams" ON "events"."id" = "events_teams"."event_id" WHERE "events_teams"."team_id" = ?  [["team_id", 4]]
DELETE FROM "teams" WHERE "teams"."id" = ?  [["id", 6]]

				end
			end
		end
		if @team.update(team_params)
---
UPDATE "teams" SET "schoolType" = ?, "updated_at" = ? WHERE "teams"."id" = ?  [["schoolType", "higher"], ["updated_at", "2018-01-13 09:32:26.875797"], ["id", 4]]