app/controllers/users_controller.rb

	def index
		@users = User.all
=begin
		@filterrific = initialize_filterrific(
			User,
			params[:filterrific],
			persistence_id: 'shared_key',
			default_filter_params: {},
			) or return
		@users = @filterrific.find.page(params[:page]).per_page(10)
---
SELECT  "users".* FROM "users" WHERE ((LOWER(users.firstName) LIKE 'Иванов%' OR LOWER(users.lastName) LIKE 'Иванов%') AND (LOWER(users.firstName) LIKE 'Ив%' OR LOWER(users.lastName) LIKE 'Ив%')) ORDER BY "users"."id" ASC LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 0]]
SELECT  "users".* FROM "users" WHERE ((LOWER(users.firstName) LIKE 'Иванов%' OR LOWER(users.lastName) LIKE 'Иванов%') AND (LOWER(users.firstName) LIKE 'Ив%' OR LOWER(users.lastName) LIKE 'Ив%')) LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users" WHERE ((LOWER(users.firstName) LIKE 'Иванов%' OR LOWER(users.lastName) LIKE 'Иванов%') AND (LOWER(users.firstName) LIKE 'Ив%' OR LOWER(users.lastName) LIKE 'Ив%'))

	def show
		if not logged_in?
			redirect_to root_path
		end
		@user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def create
		@user = User.new(user_params)

	if @user.save
---
INSERT INTO "users" ("lastName", "firstName", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["lastName", "Ломазина"], ["firstName", "Таня"], ["email", "email@mail.ru"], ["created_at", "2018-01-10 15:58:35.434357"], ["updated_at", "2018-01-10 15:58:35.434357"]]

	def update
	if params[:password].blank?
		params.delete(:password)
	end
		@user = User.find(params[:id])

		if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "lastName" = ?, "firstName" = ?, "fathersName" = ?, "school" = ?, "group" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["lastName", "Ломазина"], ["firstName", "Татьяна"], ["fathersName", "Андреевна"], ["school", "ПетрГУ"], ["group", "22509"], ["updated_at", "2018-06-30 14:23:02.044918"], ["id", 5]]